<template>
  <div class="py-6">
    <div class="max-w-7xl mx-auto px-4 sm:px-6 lg:px-8">
      <BoxHeader :header="'Росатом.Образование'"
                 :subheader="'Образовательные программы для начинающих стартаперов'"/>

      <div class="relative items-center justify-center mt-8">
        <carousel :autoplay="false" :nav="false">
          <EducationCard
              :title="'Курс начинающих предпринимателей'"
              :content="'Как выбрать и проверить на жизнеспособность бизнес-идею, как выстроить сервис и продажи, а также наладить работу с клиентами.'"
          />
          <EducationCard
              :title="'Эффективное управление'"
              :content="'Что такое стратегическое видение бизнеса, эффективнно руководить и выстраивать систему управления.'"
          />
          <EducationCard
              :title="'Управление проектами и продуктами'"
              :content="'В России есть программы, которые занимаются поддержкой малого и среднего бизнеса. Рассказываем о них подробно.'"
          />
          <EducationCard
              :title="'Курс начинающих предпринимателей'"
              :content="'Как выбрать и проверить на жизнеспособность бизнес-идею, как выстроить сервис и продажи, а также наладить работу с клиентами.'"
          />
          <EducationCard
              :title="'Эффективное управление'"
              :content="'Что такое стратегическое видение бизнеса, эффективнно руководить и выстраивать систему управления.'"
          />
          <EducationCard
              :title="'Управление проектами и продуктами'"
              :content="'В России есть программы, которые занимаются поддержкой малого и среднего бизнеса. Рассказываем о них подробно.'"
          />
          <EducationCard
              :title="'Курс начинающих предпринимателей'"
              :content="'Как выбрать и проверить на жизнеспособность бизнес-идею, как выстроить сервис и продажи, а также наладить работу с клиентами.'"
          />
          <EducationCard
              :title="'Эффективное управление'"
              :content="'Что такое стратегическое видение бизнеса, эффективнно руководить и выстраивать систему управления.'"
          />
          <EducationCard
              :title="'Управление проектами и продуктами'"
              :content="'В России есть программы, которые занимаются поддержкой малого и среднего бизнеса. Рассказываем о них подробно.'"
          />
        </carousel>
      </div>
    </div>
  </div>
</template>

<script>
import carousel from 'vue-owl-carousel'

import BoxHeader from "@/components/BoxHeader";
import EducationCard from "@/components/EducationCard";

export default {
  components: {
    BoxHeader,
    EducationCard,
    carousel
  }
}
</script>